{"type": "review", "id": "Z3A6QU9xcFRPSGJ6U2otV3BBMFRQbWg4RTAta0lZMjJsUHRkV2NtekRKX0dqbFhpSGFOVXRZWUpCdmxTY01qdmpDcFpzUzV0WmdGVUs1eXhmTmExNDBRRmc", "date": "2015-04-09T00:00:00Z", "author_id": "117024964158341358518", "author_name": "Wesley G", "rating": 4, "title": "Very useful to those in need", "comment": "People who have problems could really make use of this. I'm sure internet/phone trolls would use it too lol. Nice work though."}
{"type": "review", "id": "Z3A6QU9xcFRPRWdJQ09JVVlwdWhJUVBXaUhPbXU1Zm9KVHBnclR0M3NCdUFtdmpzc0dJbm8zWnZDMS1kR1VfWjNzRXZWLXJvZkFEdVducmI4cEE4ODVaaWc", "date": "2015-03-23T00:00:00Z", "author_id": "109652620861081672968", "author_name": "Brooke L", "rating": 5, "title": "Amazing app", "comment": "This app is perfect for someone who struggles with aphasia but is still able to read. I love the customization options, and the ability for each word pressed to take you to a page with the most likely next word is extremely helpful. Also, my thanks to the dev for implementing a consistent back/home button when adding new tabs! I do have one request, it's the only reason I keep a 2nd AAC app installed in addition to this one: I use a bluetooth keyboard to navigate my tablet - I'm sure I'm not the only one. This app is great for expressing frequently-said words and phrases, but as it's impossible to predict everything I want to say (and time consuming to touch each word of a sentence individually), sometimes I prefer typing with my keyboard. I know this app allows for that if you press the menu button and enter a special screen, but that separates it from the other features and being able to simply press a button immediately for a quick reply or pre-buttoned word/phrase. The other app I sometimes use remedies this by having an entry line at the top of the main screen itself. If this app could do something similar, that would be great. Still, terrific app!"}
{"type": "developer_reply", "review_id": "Z3A6QU9xcFRPRWdJQ09JVVlwdWhJUVBXaUhPbXU1Zm9KVHBnclR0M3NCdUFtdmpzc0dJbm8zWnZDMS1kR1VfWjNzRXZWLXJvZkFEdVducmI4cEE4ODVaaWc", "date": "2015-03-23T00:00:00Z", "comment": "Thanks for getting in touch.  I liked your idea about adding the \"back\" button to all new tabs by default.  I added the feature today, it should be available on the play store in a few hours.  The button will only appear on new tabs, I will have to give some thought about how to make it easy to add that to existing tabs."}
{"type": "review", "id": "Z3A6QU9xcFRPSHVSX2I5YlkyU1NOMnJfeDNyd1JaZDVwOEN6cFBvSG5lekRWNjJBZUdmNXFZNVNMZlFzUUN5U3VFZ01WaFQ0MzVWUWhDSzVyZ0g1Vk55V2c", "date": "2014-07-30T00:00:00Z", "author_id": "113156832802604801814", "author_name": "April Gear", "rating": 5, "title": "Awesome!", "comment": "I have trouble w/ words sometimes due to fibro fog and this will come in handy."}
{"type": "review", "id": "Z3A6QU9xcFRPRTNvbTkxUXhJSU9ibnM3T3NIT2taZ3BhczVJTDJmc0hiT1dFUmhZeHAzcGgwdDZCYlI0alhWVXVFSDY1VnAyWFlVdzQwSDlOeHhJcVRMbkE", "date": "2014-07-01T00:00:00Z", "author_id": "110641771211772099799", "author_name": "Muff Arrow", "rating": 5, "title": "Useful", "comment": "I don't need this app but it is very very useful for people who needs it."}
{"type": "review", "id": "Z3A6QU9xcFRPRWpJUDlXZ0ZiUjRmQVFBaHBFQUpzV3ZNc0pSbHZBYkN5cjRjM1FacnJ5NWF4R0t4YzZmM0sxY241bGtsYWVzQ2g5RUpONmpuZmotOWszUHc", "date": "2014-06-05T00:00:00Z", "author_id": "113632110349970795430", "author_name": "Raj Khuti", "rating": 5, "title": "Great App", "comment": "I have used this app to help a number of friends after  traumatic incidents, works wonders easy to adapt and change the buttons to suit both the user and the carer.  Raj Khuti sevasolutions"}
{"type": "review", "id": "bGc6QU9xcFRPSHBNSTBIWnNod3labWJzUFBPeHU3LWhCUWs4aXk2N1FiWERXVElNMW9RR2NESERDM2VZcGw2UEdqdkYyVG1SOC0wSjNlaHNYODBqQUYwVFE", "date": "2012-10-01T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": "Great idea, needs work", "comment": "Stability problems (adding new buttons)! TTS caching finally fixed. Demo soundboards aren't useful. TTS text when creating a new button on a soundboard could be copied to the label automatically. Small problems with customizability. Otherwise good. Deserves 4 stars if the stability issues are dealt with and an honest 5 if all minor issues are fixed. I rate it 5 up-front because it's honestly the most promising app of the sort."}
{"type": "developer_reply", "review_id": "bGc6QU9xcFRPSHBNSTBIWnNod3labWJzUFBPeHU3LWhCUWs4aXk2N1FiWERXVElNMW9RR2NESERDM2VZcGw2UEdqdkYyVG1SOC0wSjNlaHNYODBqQUYwVFE", "date": "2014-01-12T00:00:00Z", "comment": "The author of this review kindly corresponded with me a few times.  Based on his feedback a lot of key improvements were made, including much more practical demo data."}
