{"type": "review", "id": "Z3A6QU9xcFRPSGhxNjI5WjZNaHhFY3Q5OEFob3pLT0dNQ29uMHJmZDA4T3pXOThrcHVmcXdzSk1yb1pzY2dhdGxkWklnbGxXcjZ6SE81S2Q0eUlaQmVrSkVn", "date": "2014-12-11T00:00:00Z", "author_id": "100849775128921023307", "author_name": "Wireball MacCarter", "rating": 5, "title": "Demonstrates that anything can read the clipboard", "comment": "Simple utility for confirming that android apps can indeed sniff all data copied to the clipboard, even if they're running in the background and you're not specifically pasting to them (at least on Android 4.4.4 KitKat, probably others).  This read copy-pasted URLs, copy-pasted snippets of text, and yes even copy-pasted passwords.  Kudos on the lack of Internet permissions."}
{"type": "review", "id": "Z3A6QU9xcFRPRTVxMVV5bjRQd1hnVUtqZ0VLT1lOMS1xeEprMXA3RjdKMVNLcGJGaG9ZX0c5Q3djTTlndVVIcnQweTF4WkJkUVpHbFhreVVhbGxXbVFkUnhn", "date": "2014-12-11T00:00:00Z", "author_id": "110646726753741919166", "author_name": "Jeff H", "rating": 4, "title": "Good work!", "comment": "This is a great app if you have one the password apps it's built for. Some managers that use the clipboard also pass tons of formatting data (Lastpass) and can make it difficult to see what's happening -  this clears that for you."}
{"type": "developer_reply", "review_id": "Z3A6QU9xcFRPRTVxMVV5bjRQd1hnVUtqZ0VLT1lOMS1xeEprMXA3RjdKMVNLcGJGaG9ZX0c5Q3djTTlndVVIcnQweTF4WkJkUVpHbFhreVVhbGxXbVFkUnhn", "date": "2014-12-02T00:00:00Z", "comment": "Good questions, 350 characters ain't enough! I've sent you a reply via Hangouts, if you prefer a public forum we can use GitHub. I've changed the description to be clearer on the scope. A quick correction for others reading this; clearing the clipboard won't protect against this as the contents are sent to every app as soon as the copying happens."}
{"type": "review", "id": "Z3A6QU9xcFRPRm5kMjNEWjNpUWYxZ2NLVEtfVnBFem55RG9KcDRnZVl4UGcyQkdjZzRURkJsVjd0eXBqdWxiMWxERWZDQ0prcmV0Z0EtMm1MUmxsbUtUOXdF", "date": "2014-11-21T00:00:00Z", "author_id": "113423432835494302553", "author_name": "Jack Melanson", "rating": 5, "title": "I gots ta know", "comment": "Did he fire six shots or only five? UPDATE: all kidding aside, this app is an eye opening experience. I thought I was a fortress of security with my password strategy. The results proved otherwise. Thanks to the Dev for a great tool."}
{"type": "developer_reply", "review_id": "Z3A6QU9xcFRPRm5kMjNEWjNpUWYxZ2NLVEtfVnBFem55RG9KcDRnZVl4UGcyQkdjZzRURkJsVjd0eXBqdWxiMWxERWZDQ0prcmV0Z0EtMm1MUmxsbUtUOXdF", "date": "2014-12-02T00:00:00Z", "comment": "Well to tell you the truth, I kind of lost track myself. But this being a .44 magnum, the most powerful handgun in the world, one shot would blow your head clean off. So you gotta ask yourself; \"Do I feel lucky?\" Well do ya? Punk? UPDATE: Thanks Jack! It was eye opening for me too when I stumbled across it, glad to hear it!"}
