{"type": "review", "id": "bGc6QU9xcFRPRno2T3lJeW9WZ2VzWF82YXpsaE1TSUQzMGhHSGNzS3NmSm9ZWEdUVEpNSW91Vk5Xekc4Vk9RZzJZcFNVYVJvbXRqYXJ1aTRXZzcwSVRsTmlV", "date": "2015-06-16T00:00:00Z", "author_id": null, "author_name": null, "rating": 3, "title": null, "comment": "This is potentially a great app that implements the svn protocol well. However beware! The release information says \"Working copies can now be saved anywhere in the filesystem.\" This was true in 2012 when the release was made. It is no longer - it seems you cannot write to an external SD if you are using android 4 or 5. For android 4 this is largely down to google. But google extended the interface in android 5 to cleanly permit apps to do precisely this. C'mon guys, it's time for an update!!!"}
{"type": "review", "id": "Z3A6QU9xcFRPSGFGaDRtcXY3RmFzR0J0VUFwSDVMNzU3dzB4TzB3aVBTQ0RJQ2x2SmRBMDJxRk5BYTdYd0xINXVRS19nRzFra3Q3TTdRNFV3bHZpdUNiVzhj", "date": "2013-08-24T00:00:00Z", "author_id": "106171189616132035293", "author_name": "Florin Eugen", "rating": 2, "title": "repository on local network", "comment": "impossible to connect to a repository on local network  \"file://server\""}
{"type": "review", "id": "bGc6QU9xcFRPSFF4T3U5UFJvc2VGVDZqcGk2clhwNWNqQi1pdnBweE1hWFdGSXpCVkNsTVNnRGF2RmZmZEphYU5lWHA3Vjg0aDFOanNLLVc2ck12NHRobVVF", "date": "2012-11-15T00:00:00Z", "author_id": null, "author_name": null, "rating": 3, "title": "Good start, but needs to be useful...", "comment": "Good:  Simple interface and big buttons for easily reading and browsing.  File transfer was quicker than I expected (in Wi-Fi) for the big files I was moving around.  Bad:  This app is using a developer's point of view.  Normally I wouldn't expect an user to check out a full real repository.  Maybe people who use it like DropBox, but for development projects we have lots of files which doesn't make sense to check out.  This is a big deal breaker for me.  TODO: - Think of the SVN repo as just a way to access a cloud file explorer.. - Add file manager utilities like:  add, delete, modify files on the fly - Add functionality to look history over a file - If I access SVN in the phone and not in a computer, is because I have a quick task that shouldn't need a PC.  I think the base is here, hopefully you add this real useful features!!"}
{"type": "review", "id": "bGc6QU9xcFRPR1Y4VjNackg0d1hVWUoxQjdmLUxUSFB6WXRSbDFWdHF2QmpXU0dWS2VWR294ZU0yQUUxbVVVNXRkWXRNSVQyTE5EbXo4RWN0T0l3UjF6cGJR", "date": "2012-09-23T00:00:00Z", "author_id": null, "author_name": null, "rating": 1, "title": "Does not work Asus eee pad", "comment": "When I use the checkout option it says it gets my repository successfully but there is nothing downloaded to the local folder. Asus eee pad TF101. Please fix and I will up my stars"}
{"type": "review", "id": "bGc6QU9xcFRPR3pWdXg2OGNQbmplTXJYbGFjeEE1ZEpOeV9sZEQta2U3YllIbzVFWHJSOVhwLWV6WERLaFg5TjljTXNmcWQ0RlZNMmJ6dU1wQkdYbk5KS3lJ", "date": "2012-09-08T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": "Works like a charm!", "comment": "This app is a dream come true for using SVN on the road.  I just checked out a 1.4GB/42,000 file repository.  Update, Commit and Cleanup worked great.  The external SD option would be a nice boon.  Definitely a great product that I'm happy to own, that saves me time from going home."}
{"type": "review", "id": "bGc6QU9xcFRPR2VDUmlQbXF6NHE0MTdCTHZ4Vk00b0ZfbHZGOEtiWWVhNHFFYncyZTJhaTEwTHp0ekIxNzVfd0ZhS2FVOTNRZTdSM0E4MnVWNEktOFBPaXBr", "date": "2012-09-04T00:00:00Z", "author_id": null, "author_name": null, "rating": 2, "title": "Great so far, but needs work.", "comment": "This app does do checkout's ok. I find it is slow, uninformative in what it's doing, and I have had trouble getting it to do commit's.  The application needs work to improve stability and a general polish would not hurt either. The developer is heading in the right direction and once some of the issues I'm having are resolved, I'll bump my rating up. It's still worth the purchase as this is currently the only android app I found that can do checkout's and checkin's."}
{"type": "review", "id": "bGc6QU9xcFRPR1hhNXRONVZnVVNEOTNfd0dLa2FzXzVmTGRwTUpVbnY0aWpEcUI4YmVQSGE2V29vdzM2WmVEemNPREhLcHRrWnVKOWtLNHdVOFo3eFRiQUlJ", "date": "2012-08-24T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": "Amazing app!!  Glad someone beat me to porting it!", "comment": "I was starting to port svnkit to android platform, but I'll gladly pay to have this one.  Used with DROID 4 for both update and commit.  Could use a bit more explanation about internal and SD card storage, but still great.  Watch for 'cards' not mounted before doing an 'update' or it will try to do a checkout on an invalid location."}
{"type": "review", "id": "bGc6QU9xcFRPSHpmQUJFdkVNZHV4WHFaN01xSHFFbVE4ZHcyaWRpdWRPVkNRcDlvZTNldFlvOEFBTlRua3N2R243aW9FSVVDTEp3UXVXeWo2WUdNT3JlRWR3", "date": "2012-08-18T00:00:00Z", "author_id": null, "author_name": null, "rating": 1, "title": "Cannot connect to SVN on Seagate disk", "comment": "This program will not connect to SVN on my Seagate GoFlex NAS disk even though other Android apps can connect to the disk. And Android Play will not refund my purchase because it is the second time that I try it!"}
{"type": "review", "id": "bGc6QU9xcFRPR2lXWDl4dTlFRnYtU081QXloUjRlNy11UlJwMVBLX3ltU2prR3JUV3c4M0E2RExyQU1mdHpQNC1ZeDhnVFBzVGNYdV9sZ1hqR21tYjBnU0Rz", "date": "2012-08-08T00:00:00Z", "author_id": null, "author_name": null, "rating": 4, "title": "Good SVN Client", "comment": "Seems to work quite well, and is really the only fully-featured SVN client on Android. However, support for SSH public keys would help a lot."}
{"type": "review", "id": "bGc6QU9xcFRPSFNZY2pSdTNUeFpYZzNLeFZ1R3NNeGEwWnQ4MVJfcXY3SEFQRUtWYW5SYnRMbmdhcFRzN2I1bzJkWUlqSXFhRFlPbU9BTjVFMUhtamxXb3Rv", "date": "2012-07-26T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": "Great!", "comment": "Thank you for this amazing app. I am working on my thesis (which is versioned in a svn vcs of course) and being able to make changes on the run is invaluable. I found the app's name on xda and gladly bought it a few seconds later. No issues whatsoever."}
{"type": "review", "id": "bGc6QU9xcFRPR2hWbE9ocVV5X3h3c0FIbnRMS2VhYzU3SExYTDBnb2x2YWQzbUFpUFM4cTFra2pNYi1rYXZsb3pYZUlHbnFKQmNZbWtDSUlWWkVydkFPRF93", "date": "2012-06-15T00:00:00Z", "author_id": null, "author_name": null, "rating": 4, "title": "great svn client", "comment": "its a perfect svn client for android devices for it has almost all functionalities needed for an SVN client. i though have a little problem in local storage, it is stored in my default storage. i have an external_sd where i store my files so that the default sdcard wont be occupying much space.              /mnt/sdcard/ - default local storage /mnt/external_sd/ - my external microsd memory card (not included on purchase) during adding of repository, my local folder is set to \"/mnt/external_sd/mysvn\" but the result was \"/mnt/sdcard/OASVN//mnt/external_sd/mysvn\" so i decided to set it \"../../external_sd/mysvn\" to save it in my external_sd.              in the end, i still give this a thumbs-up for a great app."}
{"type": "review", "id": "bGc6QU9xcFRPRnFscVpweFJiTjRzRmV5NmtyaW1BTHRTeHdHdlRBNlBIbGMwLUxiOFN6ME1qV1h1enpQcW1peTBsdmUyN2pRaTVTVDJqRmE5V0QyVE9tbms4", "date": "2012-05-18T00:00:00Z", "author_id": null, "author_name": null, "rating": 4, "title": "Can now svn update the repo, and much else.", "comment": "I previously left this review with two stars:  \"You can check out a repo, and commit to a repo, but that's it. You cannot run svn update for instance, even with the 'Pro' version, so I would say that this is not the 'full' client yet that it claims to be, and in fact still has only a very limited subset of svn features.   The features it does have do seem to work well enough, but I wouldn't download, or pay, for this if you will want to do anything other than basic checkout and commit operations.\"  But now it seems with the latest version, you can actually do these things, so it is now what I always dreamed it would be!"}
{"type": "review", "id": "bGc6QU9xcFRPRVpGRjBoRlUtWkE0SC1lSHlndGFKaTFOVmZNZ2tyNTFIMFNqYUFVNmJJMk9laHRkb2ZsUzFpV1hBY19YNXhLLUh0NHdkcEtvS0dDcHhwLWZn", "date": "2012-05-03T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": null, "comment": "Reliable app with quickly growing feature set"}
{"type": "review", "id": "bGc6QU9xcFRPRWNzVnh5M3M3RUxjYjd2dnIyUlNFTi1fTFg3TEN2NjJXNHo3ODc2RVZGeE5Jdzh4cHA4SjdWNUZOcThaT0dMUk1jSG5TR0ZncDBUTlRCMzhr", "date": "2012-04-28T00:00:00Z", "author_id": null, "author_name": null, "rating": 4, "title": "Works well, needs more features", "comment": "I agree completely with Grayson's comments and second them.  This client needs to use \"update\" when a checkout already exists on the device, and needs to show changed files."}
{"type": "review", "id": "bGc6QU9xcFRPRS1uOGc0R05jVUJoOUsxYmE3Rl95aDUySF92NVgzSk1SS29VTHo4c1gwX0tDcmpnZUxKaTVCcTdvSXQ3YjBDUnZ2WkNFRHVUcFZOZXV6Ykg4", "date": "2012-04-28T00:00:00Z", "author_id": null, "author_name": null, "rating": 3, "title": "No cleanup option", "comment": "If any operation fails you can not recover as there is no cleanup option. So you have to delete, redefine and checkout again the all repository.   Other then that it works great."}
{"type": "review", "id": "bGc6QU9xcFRPRnpQaWtMTERna0NFYTJOZGJad3F3dDBOSlBvTVZXaGdpZWItSmRQREJGNURmQXptZUtyblAtdlhoNnl5SkhQMkhMb0ViaGxvRmVTUUVWdUM0", "date": "2012-04-21T00:00:00Z", "author_id": null, "author_name": null, "rating": 4, "title": "SVN on Android!", "comment": "This + AIDE allow me to seamlessly switch between developing on my phone, tablet and desktop.  OASVN is the first SVN client I've found that allows me to commit changes from my Android devices.  For this functionality, it gets 4 stars.  It could use some improvement, though.  Switching from the free to PRO version, no information is copied over.  You have to manually enter the repo again, and then either manually move the directory on your SD card, or do a full checkout again.  Also, there is no list of changed files on commit, and no way to check if a file has changed.  OASVN needs to allow the user to see what files have been modified, add files, remove files, resolve conflicts, and show a changeset on commit.  Still a ways to go, but great start!"}
{"type": "review", "id": "bGc6QU9xcFRPRWt5Zm43MlVfODZrY1U0bzBfZEhsZUNmRGRTZ2FJRS13UndtZnhRX3lhUWxnRGNCN1h5ZDZTMTUxdHVpYzZpNjFjY1VoM1hkcnJpMnBoOFZZ", "date": "2012-04-05T00:00:00Z", "author_id": null, "author_name": null, "rating": 5, "title": "Awesome!", "comment": "Finally a decent svn client!"}
