{"type": "review", "id": "Z3A6QU9xcFRPRktmU3ozU0xYV21ZanFoOE8xZDFNZ2s5VWRBR0RsRUZzZmdlTFZWeWpQc0EyQWFBeVU5NU4waXhqRmc3NTlfeEtPQmpBblNGRWhMa1laQWc", "date": "2015-01-02T00:00:00Z", "author_id": "108043100271267170491", "author_name": "Stefan Vorell", "rating": 5, "title": "Awesome app, well integrated into GNOME 3... one problem", "comment": "According to the bugtracker for this project the lead developer died in a car accident last month."}
{"type": "review", "id": "Z3A6QU9xcFRPRnpXTkdEakk3cU9STTdSV2xQS3QzSzVGbE5ZenlkMWQ0Wm5ndHptZDluZTR2MU9uX2wzMnRoU2tRQnRlNGNGcGVjV1FGU3NLYVFlbnZjdnc", "date": "2014-11-05T00:00:00Z", "author_id": "117914197047183223792", "author_name": "dsngjoe2", "rating": 4, "title": "Very Good Work Keep it up!", "comment": "This is very awesome and it works very well but still needs more time.  So I am using Antergos (Arch based Distro).  In the AUR Deskcon was there ready to install.  It installed but I was missing the icon on the top right corner.  You have to go to the Github to download the Gnome Shell Extension.  You download it and move the extension to the location where they are located.  The github has the actual path.  You activate via tweak tools in gnome.  Then the icon will be there.   I wanted this feature to read and send txt.  It works but if you want to send texts you need to know the number.  The software still does not sync to your contacts yet.  Right now you need to type the actual number to everyone you want to txt.  If someone txt's you, you can click reply and it's much easier.  I think the developer is doing well and cant wait till they add a way to import our contacts from the phone or something.  Typing numbers to txt for every text will wear you out.    Developer Keep up the great work!  Please implement a way to send txt from the contact list."}
{"type": "review", "id": "Z3A6QU9xcFRPSDlpXzhja0E2dUt2akpqM241dEp4UFFzV3k0aWczZXBwRVFKOGJwcUt5MTVjWVhkR2tsaWExNmxGQW1MSlhKTGgxLVk1SC0zaUtBVkJSemc", "date": "2014-11-03T00:00:00Z", "author_id": "114901900577426351828", "author_name": "Evgenii Frolov", "rating": 5, "title": "Super nice! Some questions though...", "comment": "The app is very promising though is seems to be just not ready yet. The functionality and workflow is great, but it seems strange to be forced to launch a separate server instance in a terminal, while there is a Gnome3 extension that (may be) can do it for you! By the way, where is the very official extension on the Gnome3 extensions web-page? Why should I install it from the github? Nevertheless, I give 5 out of 5 because everything is just SO promising and works nice! Hope to see \"Launch server\" button in the gnome3 extension and the extension itself on the gnome3 extensions web page soon! Thanks a lot for the app!"}
{"type": "review", "id": "Z3A6QU9xcFRPRWoyNlBDNWVkUkNjZDNsNWZzZEM1SVdpRl9aang0T3g4SHgzbVhoMHlLRUNpcld4MGhsa1dpSGNLc25yVkU2U2N6bXlzd1ZjQ2JfNi1hbVE", "date": "2014-06-19T00:00:00Z", "author_id": "117811630989634827861", "author_name": "Dusten Barker", "rating": 5, "title": "Pretty cool.", "comment": "Can't wait for this to mature."}
{"type": "review", "id": "Z3A6QU9xcFRPRzVwTFFYR1dkM3VjVFZYWWo1RS1qX1dsbk51S01EM29HYV82c1QwXzJ6RU14WUNuQjZDZGZDZWlJd2tqSXN0akx3QVZnTVdRX0pQa29TLVE", "date": "2014-06-15T00:00:00Z", "author_id": "105012445426980673641", "author_name": "Jay Dresser", "rating": 4, "title": "Shows great promise,", "comment": "even though I don't have everything working yet."}
{"type": "review", "id": "Z3A6QU9xcFRPR3kxMXg1ZTFNeEN3dW1ndlVEVE1JaHAtUHJ3aVFJLVdCWmN2NmRpSTkxTXd0dTlwTVp2M2dzN2pwUFFSYm5vcWR3VUhjTW1TR2MzZVFJTlE", "date": "2014-06-09T00:00:00Z", "author_id": "103139396815756975243", "author_name": "Steve Maysey", "rating": 5, "title": "Just what I was looking for!", "comment": "Great app for Gnome desktop users. Love the ability to compose SMS messages from my laptop. Extremely small price to pay for such functionality. Keep up the good work!"}
